app/controllers/boardlogins_controller.rb

  def show
    @boardlogin = Boardlogin.find(params[:id])

    respond_to do |format|
		#if @boardlogin.nil?
		if @boardlogin.length == 0
			redirect_to(new_boardlogin_path)
		else
			format.html # show.html.erb
			format.xml  { render :xml => @boardlogin }
			@boardlogin.destroy
---
SELECT * FROM "boardlogins" WHERE ("boardlogins"."id" = 54)
SELECT * FROM "boardlogins"
DELETE FROM "boardlogins" WHERE "id" = 54

  def create
    @boardlogin = Boardlogin.new(params[:boardlogin])

    respond_to do |format|
      if @boardlogin.save
---
INSERT INTO "boardlogins" ("created_at", "updated_at", "userid", "password") VALUES('2010-10-21 18:03:22', '2010-10-21 18:03:22', 'official', 'jcfop14')